[{
  "_id": "Barbarian",
  "hitDie": 12,
  "weaponProficiencies": [
    "Simple",
    "Martial"
  ],
  "armorProficiencies": [
    "Light",
    "Medium",
    "Shields"
  ],
  "skillProficiencies": [
    "Animal Handling",
    "Athletics",
    "Intimidation",
    "Nature",
    "Perception",
    "Survival"
  ],
  "savingThrowProficiencies": [
    "Strength",
    "Constitution"
  ],
  "classFeatures": [
    {
      "name": "Rage",
      "level": 1,
      "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.  While raging, you gain the following benefits if you aren’t wearing heavy armor:  You have advantage on Strength checks and Strength saving throws. When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table. You have resistance to bludgeoning, piercing, and slashing damage. If you are able to cast spells, you can’t cast them or concentrate on them while raging.  Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.  Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
    },
    {
      "name": "Unarmored Defense",
      "level": 1,
      "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
    },
    {
      "name": "Reckless Attack",
      "level": 2,
      "description": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
    },
    {
      "name": "Danger Sense",
      "level": 2,
      "description": "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger.  You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated."
    },
    {
      "name": "Primal Path",
      "level": 3,
      "description": "At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
    },
    {
      "name": "Ability Score Improvement 1",
      "level": 4,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Ability Score Improvement 2",
      "level": 8,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Ability Score Improvement 3",
      "level": 12,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Ability Score Improvement 4",
      "level": 16,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Ability Score Improvement 5",
      "level": 19,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Extra Attack",
      "level": 5,
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
    },
    {
      "name": "Fast Movement",
      "level": 5,
      "description": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor."
    },
    {
      "name": "Feral Instinct",
      "level": 7,
      "description": "By 7th level, your instincts are so honed that you have advantage on initiative rolls.  Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
    },
    {
      "name": "Brutal Critical",
      "level": 9,
      "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.  This increases to two additional dice at 13th level and three additional dice at 17th level."
    },
    {
      "name": "Relentless Rage",
      "level": 11,
      "description": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.  Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
    },
    {
      "name": "Persistent Rage",
      "level": 15,
      "description": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
    },
    {
      "name": "Indomitable Might",
      "level": 18,
      "description": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
    },
    {
      "name": "Primal Champion",
      "level": 20,
      "description": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
    }
  ],
  "archetypes": [
    {
      "name": "Path of the Berserker",
      "description": "For some barbarians, rage is a means to an end—that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berserker’s rage, you thrill in the chaos of battle, heedless of your own health or well-being.",
      "features": [
        {
          "name": "Frenzy",
          "level": 3,
          "description": "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion (as described in appendix A)."
        },
        {
          "name": "Mindless Rage",
          "level": 6,
          "description": "Beginning at 6th level, you can’t be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage."
        },
        {
          "name": "Intimidating Presence",
          "level": 10,
          "description": "Beginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you.  If the creature succeeds on its saving throw, you can’t use this feature on that creature again for 24 hours."
        },
        {
          "name": "Retaliation",
          "level": 14,
          "description": "Starting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature."
        }
      ]
    }
  ],
  "archetypeMetaName": "Primal Path",
  "spellCastingAbility": "Nome",
  "cantripsKnown": 0,
  "_class": "net.characterGen.CharacterClassMongo.CharacterClassModels.CharacterClass"
},{
  "_id": "Bard",
  "hitDie": 8,
  "weaponProficiencies": [
    "Simple",
    "Hand Crosbow",
    "Longsword",
    "Rapier",
    "Shortsword"
  ],
  "armorProficiencies": [
    "Light"
  ],
  "toolProficiencies": [
    "Musical instrument 1",
    "Musical instrument 2",
    "Musical instrument 3"
  ],
  "skillProficiencies": [
    "Any",
    "Any",
    "Any"
  ],
  "savingThrowProficiencies": [
    "Dexterity",
    "Charisma"
  ],
  "classFeatures": [
    {
      "name": "Spell Casting",
      "level": 1,
      "description": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations."
    },
    {
      "name": "Bardic Insperation",
      "level": 1,
      "description": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6. Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the GM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest. Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."
    },
    {
      "name": "Jack of All  Trades",
      "level": 2,
      "description": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn’t already include your proficiency bonus."
    },
    {
      "name": "Song of Rest",
      "level": 2,
      "description": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level."
    },
    {
      "name": "Bard College",
      "level": 3,
      "description": "At 3rd level, you delve into the advanced techniques of a bard college of your choice: the College of Lore or the College of Valor, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th and 14th level."
    },
    {
      "name": "Expertise",
      "level": 3,
      "description": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. At 10th level, you can choose another two skill proficiencies to gain this benefit."
    },
    {
      "name": "Ability Score Improvement 1",
      "level": 4,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Ability Score Improvement 2",
      "level": 8,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Ability Score Improvement 3",
      "level": 12,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Ability Score Improvement 4",
      "level": 16,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Ability Score Improvement 5",
      "level": 19,
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
    },
    {
      "name": "Font of Insperation",
      "level": 5,
      "description": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest."
    },
    {
      "name": "Countercharm",
      "level": 6,
      "description": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."
    },
    {
      "name": "Magical Secrets",
      "level": 10,
      "description": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any class at 14th level and again at 18th level."
    },
    {
      "name": "Supeior Insperation",
      "level": 20,
      "description": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use."
    }
  ],
  "archetypes": [
    {
      "name": "College of Lore",
      "description": "Bards of the College of Lore know something about most things, collecting bits of knowledge from sources as diverse as scholarly tomes and peasant tales. Whether singing folk ballads in taverns or elaborate compositions in royal courts, these bards use their gifts to hold audiences spellbound. When the applause dies down, the audience members might find themselves questioning everything they held to be true, from their faith in the priesthood of the local temple to their loyalty to the king. The loyalty of these bards lies in the pursuit of beauty and truth, not in fealty to a monarch or following the tenets of a deity. A noble who keeps such a bard as a herald or advisor knows that the bard would rather be honest than politic. The college's members gather in libraries and sometimes in actual colleges, complete with classrooms and dormitories, to share their lore with one another. They also meet at festivals or affairs of state, where they can expose corruption, unravel lies, and poke fun at self-important fi",
      "features": [
        {
          "name": "Bonus Proficiencies",
          "level": 3,
          "description": "When you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice."
        },
        {
          "name": "Cutting Words",
          "level": 3,
          "description": "Also at 3rd level, you learn how to use your wit to distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature's roll. You can choose to use this feature after the creature makes its roll, but before the GM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can't hear you or if it's immune to being charmed."
        },
        {
          "name": "Additional Magical Secrets",
          "level": 6,
          "description": "At 6th level, you learn two spells of your choice from any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you but don't count against the number of bard spells you know."
        },
        {
          "name": "Peerless Skill",
          "level": 14,
          "description": "Starting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the GM tells you whether you succeed or fail."
        }
      ]
    }
  ],
  "archetypeMetaName": "Bardic College",
  "spellCastingAbility": "Charisma",
  "cantripsKnown": [
    2,
    2,
    2,
    3,
    3,
    3,
    3,
    3,
    3,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4
  ],
  "spellsKnown": [
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    14,
    15,
    15,
    15,
    18,
    19,
    19,
    20,
    22,
    22,
    22
  ],
  "spellSlotsPerLevel": [
    [
      2,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      3,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      2,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      2,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      1,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      1,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      1
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      1
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      1
    ]
  ],
  "_class": "net.characterGen.CharacterClassMongo.CharacterClassModels.CharacterClass"
},{
  "_id": "Cleric",
  "hitDie": 0,
  "weaponProficiencies": [
    "Simple"
  ],
  "armorProficiencies": [
    "Light",
    "Medium",
    "Shields"
  ],
  "skillProficiencies": [
    "Insight",
    "History",
    "Medicine",
    "Persuasion",
    "Rligion"
  ],
  "savingThrowProficiencies": [
    "Wisdom",
    "Charisma"
  ],
  "classFeatures": [
    {
      "name": "Spell Casting",
      "level": 1,
      "description": "As a conduit for divine power, you can cast cleric spells.  Cantrips At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table.  Preparing and Casting Spells The Cleric table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots. For example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. You can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.  Spellcasting Ability Wisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.  Spell save DC = 8 + your proficiency bonus + your Wisdom modifier Spell attack modifier = your proficiency bonus + your Wisdom modifier  Ritual Casting You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared.  Spellcasting Focus You can use a holy symbol as a spellcasting focus for your cleric spells."
    },
    {
      "name": "Divine Domain",
      "level": 1,
      "description": "Choose one domain related to your deity: Knowledge, Life, Light, Nature, Tempest, Trickery, or War. Each domain is detailed at the end of the class description, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.  Domain Spells Each domain has a list of spells—its domain spells— that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day. If you have a domain spell that doesn’t appear on the cleric spell list, the spell is nonetheless a cleric spell for you."
    },
    {
      "name": "Channel Divinity",
      "level": 2,
      "description": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description. When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again. Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC. Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.  Channel Divinity: Turn Undead As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage. A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."
    },
    {
      "name": "Destroy Undead",
      "level": 5,
      "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table.  Cleric Level\tDestroys Undead of CR... 5th\t1/2 or lower 8th\t1 or lower 11th\t2 or lower 14th\t3 or lower 17th\t4 or lower"
    },
    {
      "name": "Divine Intervention",
      "level": 10,
      "description": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great. Imploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The GM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest. At 20th level, your call for intervention succeeds automatically, no roll required."
    }
  ],
  "archetypes": [
    {
      "name": "Life Domain",
      "description": "The Life domain focuses on the vibrant positive energy, one of the fundamental forces of the universe, that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrei).",
      "features": [
        {
          "name": "Life Domain Spells",
          "level": 1,
          "description": "Cleric Level\tSpells 1st\tbless, cure wounds 3rd\tlesser restoration, spiritual weapon 5th\tbeacon of hope, revivify 7th\tdeath ward, guardian of faith 9th\tmass cure wounds, raise dead"
        },
        {
          "name": "Bonus Proficiency",
          "level": 1,
          "description": "When you choose this domain at 1st level, you gain proficiency with heavy armor."
        },
        {
          "name": "Disciple of Life",
          "level": 1,
          "description": "Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level."
        },
        {
          "name": "Channel Divinity: Preserve Life",
          "level": 2,
          "description": "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured. As an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct."
        },
        {
          "name": "Blessed Healer",
          "level": 6,
          "description": "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level."
        },
        {
          "name": "Divine Strike",
          "level": 8,
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Supreme Healing",
          "level": 17,
          "description": "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12."
        }
      ]
    }
  ],
  "archetypeMetaName": "Divine Domain",
  "spellCastingAbility": "Wisdom",
  "cantripsKnown": [
    3,
    3,
    3,
    4,
    4,
    4,
    4,
    4,
    4,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5
  ],
  "spellSlotsPerLevel": [
    [
      2,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      3,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      2,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      2,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      1,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      1,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      1,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      1,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      1,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      1,
      1,
      0
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      1,
      1,
      0
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      1,
      1,
      1
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      1,
      1,
      1
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      1,
      1,
      1
    ],
    [
      4,
      3,
      3,
      2,
      1,
      1,
      1,
      1,
      1
    ]
  ],
  "_class": "net.characterGen.CharacterClassMongo.CharacterClassModels.CharacterClass"
},{
  "_id": "Druid",
  "hitDie": 8,
  "weaponProficiencies": [
    "Club",
    "Dagger",
    "Dart",
    "Javelin",
    "Mace",
    "Quarterstaff",
    "Scimitar",
    "Sickle",
    "Sling",
    "Spear"
  ],
  "armorProficiencies": [
    "Light",
    "Medium",
    "Shields"
  ],
  "toolProficiencies": [
    "Herbalism kit",
    "Druidic"
  ],
  "skillProficiencies": [
    "Arcana",
    "Animal Handling",
    "Insight",
    "Medicine",
    "Nature",
    "Perception",
    "Religion",
    "Survival"
  ],
  "savingThrowProficiencies": [
    "Intelligence",
    "Wisdom"
  ],
  "classFeatures": [
    {
      "name": "Spell Casting",
      "level": 1,
      "description": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will.  Cantrips At 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table.  Preparing and Casting Spells The Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots. For example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. You can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.  Spellcasting Ability Wisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.  Spell save DC = 8 + your proficiency bonus + your Wisdom modifier  Spell attack modifier = your proficiency bonus + your Wisdom modifier  Ritual Casting You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.  Spellcasting Focus You can use a druidic focus (see chapter 5, “Equip- ment”) as a spellcasting focus for your druid spells."
    },
    {
      "name": "Wild Shape",
      "level": 2,
      "description": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest. Your druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.  Beast Shapes Level\tMax. CR\tLimitations\tExample 2nd\t1/4\tNo flying or swimming speed\tWolf 4th\t1/2\tNo flying speed\tCrocodile 8th\t1\t-\tGiant Eagle You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die. While you are transformed, the following rules apply:  Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them. When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious. You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that you've already cast. You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense. You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the GM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form."
    },
    {
      "name": "Druid Circle",
      "level": 2,
      "description": "At 2nd level, you choose to identify with a circle of druids: the Circle of the Land or the Circle of the Moon, both detailed at the end of the class description. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
    },
    {
      "name": "Timeless Body",
      "level": 18,
      "description": "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year."
    },
    {
      "name": "Beast Spells",
      "level": 18,
      "description": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components."
    },
    {
      "name": "Archdruid",
      "level": 20,
      "description": "At 20th level, you can use your Wild Shape an unlimited number of times. Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."
    }
  ],
  "archetypes": [
    {
      "name": "Circle of the Land",
      "description": "The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle's wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle's mysterious rites.",
      "features": [
        {
          "name": "Bonus Cantrip",
          "level": 2,
          "description": "When you choose this circle at 2nd level, you learn one additional druid cantrip of your choice."
        },
        {
          "name": "Natural Recovery",
          "level": 2,
          "description": "Starting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can't use this feature again until you finish a long rest. For example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots."
        },
        {
          "name": "Circle Spells",
          "level": 3,
          "description": "Your mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid. Choose that land - arctic, coast, desert, forest, grassland, mountain, or swamp - and consult the associated list of spells. Once you gain access to a circle spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn’t appear on the druid spell list, the spell is nonetheless a druid spell for you.  Arctic Druid Level\tCircle Spells 3rd\thold person, spike growth 5th\tsleet storm, slow 7th\tfreedom of movement, ice storm 9th\tcommune with nature, cone of cold Coast Druid Level\tCircle Spells 3rd\tmirror image, misty step 5th\twater breathing, water walk 7th\tcontrol water, freedom of movement 9th\tconjure elemental, scrying Desert Druid Level\tCircle Spells 3rd\tblur, silence 5th\tcreate food and water, protection from energy 7th\tblight, hallucinatory terrain 9th\tinsect plague, wall of stone Forest Druid Level\tCircle Spells 3rd\tbarkskin, spider climb 5th\tcall lightning, plant growth 7th\tdivination, freedom of movement 9th\tcommune with nature, tree stride Grassland Druid Level\tCircle Spells 3rd\tinvisibility, pass without trace 5th\tdaylight, haste 7th\tdivination, freedom of movement 9th\tdream, insect plague Mountain Druid Level\tCircle Spells 3rd\tspider climb, spike growth 5th\tlightning bolt, meld into stone 7th\tstone shape, stoneskin 9th\tpasswall, wall of stone Swamp Druid Level\tCircle Spells 3rd\tacid arrow, darkness 5th\twater walk, stinking cloud 7th\t_freedom of movement, locate creature 9th\tinsect plague, scrying"
        },
        {
          "name": "Land’s Stride",
          "level": 6,
          "description": "Starting at 6th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell."
        },
        {
          "name": "Nature's Ward",
          "level": 10,
          "description": "When you reach 10th level, you can't be charmed or frightened by elementals or fey, and you are immune to poison and disease."
        },
        {
          "name": "Nature's Sanctuary",
          "level": 14,
          "description": "When you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours. The creature is aware of this effect before it makes its attack against you.  Sacred Plants and Wood A druid holds certain plants to be sacred, particularly alder, ash, birch, elder, hazel, holly, juniper, mistletoe, oak, rowan, willow, and yew. Druids often use such plants as part of a spellcasting focus, incorporating lengths of oak or yew or sprigs of mistletoe. Similarly, a druid uses such woods to make other objects, such as weapons and shields. Yew is associated with death and rebirth, so weapon handles for scimitars or sickles might be fashioned from it. Ash is associated with life and oak with strength. These woods make excellent hafts or whole weapons, such as clubs or quarterstaffs, as well as shields. Alder is associated with air, and it might be used for thrown weapons, such as darts or javelins. Druids from regions that lack the plants described here have chosen other plants to take on similar uses. For instance, a druid of a desert region might value the yucca tree and cactus plants.  Druids and the Gods Some druids venerate the forces of nature themselves, but most druids are devoted to one of the many nature deities worshiped in the multiverse. The worship of these deities is often considered a more ancient tradition than the faiths of clerics and urbanized peoples."
        }
      ]
    }
  ],
  "archetypeMetaName": "Druidic Circle",
  "spellCastingAbility": "Wisdom",
  "cantripsKnown": [
    2,
    2,
    2,
    3,
    3,
    3,
    3,
    3,
    3,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4
  ],
  "spellSlotsPerLevel": [
    [
      2,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      3,
      0,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      2,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      0,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      2,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      0,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      1,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      2,
      0,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      1,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      0,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      0,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      0,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      0
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      1
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      1
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      1
    ],
    [
      4,
      3,
      3,
      3,
      2,
      1,
      1,
      1,
      1
    ]
  ],
  "_class": "net.characterGen.CharacterClassMongo.CharacterClassModels.CharacterClass"
},{
  "_id": "Fighter",
  "hitDie": 10,
  "weaponProficiencies": [
    "Simple",
    "Martial"
  ],
  "armorProficiencies": [
    "Light",
    "Medium",
    "Heavy",
    "Shields"
  ],
  "skillProficiencies": [
    "Acrobatics",
    "Animal Handling",
    "Athletics",
    "History",
    "Insight",
    "Intimidation",
    "Perception",
    "Survival"
  ],
  "savingThrowProficiencies": [
    "Strength",
    "Constitution"
  ],
  "classFeatures": [
    {
      "name": "Fighting Style",
      "level": 1,
      "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.  Archery You gain a +2 bonus to attack rolls you make with ranged weapons  Defense While you are wearing armor, you gain a +1 bonus to AC  Dueling When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.  Great Weapon Fighting When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.  Protection When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.  Two-Weapon Fighting When you engage in two-weapon fighting, you can add your ability modifier."
    },
    {
      "name": "Second Wind",
      "level": 1,
      "description": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again."
    },
    {
      "name": "Action Surge",
      "level": 2,
      "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
    },
    {
      "name": "Martial Archetype",
      "level": 3,
      "description": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed at the end of the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
    },
    {
      "name": "Extra Attack",
      "level": 5,
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
    },
    {
      "name": "Indomitable",
      "level": 9,
      "description": "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest. You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."
    }
  ],
  "archetypes": [
    {
      "name": "Champion",
      "description": "The archetypal Champion focuses on the development of raw physical power honed to deadly perfection. Those who model themselves on this archetype combine rigorous training with physical excellence to deal devastating blows.",
      "features": [
        {
          "name": "Improved Critical",
          "level": 3,
          "description": "Beginning when you choose this archetype at 3rd level, your weapon attacks score a critical hit on a roll of 19 or 20."
        },
        {
          "name": "Remarkable Athlete",
          "level": 7,
          "description": "Starting at 7th level, you can add half your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn’t already use your proficiency bonus. In addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier."
        },
        {
          "name": "Additional Fighting Style",
          "level": 10,
          "description": "At 10th level, you can choose a second option from the Fighting Style class feature."
        },
        {
          "name": "Superior Critical",
          "level": 15,
          "description": "Starting at 15th level, your weapon attacks score a critical hit on a roll of 18–20."
        },
        {
          "name": "Survivor",
          "level": 18,
          "description": "At 18th level, you attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don’t gain this benefit if you have 0 hit points."
        }
      ]
    }
  ],
  "archetypeMetaName": "Martial Archetype",
  "spellCastingAbility": "none",
  "_class": "net.characterGen.CharacterClassMongo.CharacterClassModels.CharacterClass"
}]